## 🏗️ [OpenTofu plan](https://opentofu.org)

Changes were detected in the OpenTofu plan. Please review the changes below.

<details>
<summary>
<code>make opentofu-plan</code>
</summary>

```tf
module.talos_cluster["hel01"].talos_machine_secrets.secret_bundle: Refreshing state... [id=machine_secrets]
module.talos_cluster["hel01"].data.talos_client_configuration.this: Reading...
module.talos_cluster["hel01"].data.talos_client_configuration.this: Read complete after 0s [id=hel01]
module.talos_cluster["hel01"].data.talos_machine_configuration.controlplane["antelope.nicklasfrahm.dev"]: Reading...
module.talos_cluster["hel01"].data.talos_machine_configuration.controlplane["antelope.nicklasfrahm.dev"]: Read complete after 0s [id=hel01]
module.talos_cluster["hel01"].talos_machine_configuration_apply.controlplane["antelope.nicklasfrahm.dev"]: Refreshing state... [id=machine_configuration_apply]
module.talos_cluster["hel01"].talos_machine_bootstrap.controlplane["antelope.nicklasfrahm.dev"]: Refreshing state... [id=machine_bootstrap]
module.talos_cluster["hel01"].talos_cluster_kubeconfig.this: Refreshing state... [id=lab01]

OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

OpenTofu will perform the following actions:

  # helm_release.authz will be created
  + resource "helm_release" "authz" {
      + atomic                     = true
      + chart                      = "ghcr.io/nicklasfrahm/charts/authz"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "authz"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = [
          + <<-EOT
                "global":
                  "admins":
                    "users":
                    - "nicklas.frahm@gmail.com"
            EOT,
        ]
      + verify                     = false
      + version                    = "0.1.0"
      + wait                       = true
      + wait_for_jobs              = false
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: opentofu.tfplan

To perform exactly these actions, run the following command to apply:
    tofu apply "opentofu.tfplan"
```

</details>